# **Medical Dataset Analysis: Python, SQL, and Insights**

Step into the world of data-driven healthcare analysis alongside Sarah, the healthcare data explorer, in our project, "Medical Dataset Analysis: Python, SQL, and Insights." With Python as her trusted tool and SQL as her analytical compass, Sarah embarks on a mission to unlock the potential hidden in interconnected medical datasets.

This project focuses on three critical datasets: "hospitalization_details," "medical_examinations," and "names." Divided into two essential modules, the project commences with meticulous data cleaning, ensuring the data's accuracy and structure. Once the data shines brilliantly, the second module unleashes the power of SQL queries to extract valuable insights.

Our journey is a deep dive into healthcare data, unearthing insights that can revolutionize healthcare decision-making and resource optimization. It's not just data analysis; it's a transformative voyage into the world of medical dataset analysis.

By the end of this project, you won't just crunch numbers; you'll possess the tools to drive data-powered improvements in healthcare, enhancing the lives of patients and streamlining resource allocation.

Join Sarah on this captivating journey, where every line of code and every SQL query unravels the mysteries of medical data. Together, we'll illuminate the path to actionable insights, shaping the future of healthcare with data-driven solutions.

**Module 1**

**Task 1: Loading Hospitalization Details**

In this task, we load the hospitalization details from the 'hospitalisation_details.csv' file into a Pandas DataFrame named 'hosp_details.' This step is essential for our new project, "Medical Dataset Analysis: Python, SQL, and Insights," as it forms the foundation for the data analysis and insights that we aim to derive from the medical dataset.

In [1]:
# import important library
import pandas as pd
import numpy as np

In [2]:
#--- Read in dataset(hospitalisation_details.csv) ----
hosp_details = pd.read_csv("hospitalisation_details.csv")

In [3]:
#--- Inspect data ---
hosp_details.head()

,c_id,yr,mth,date?,children?,charges?,host_tier,Ct_tier,st_id,Has_Children,Is_Frequent_Treatment
0,Id2335,1992,Jul,9,0,563.84,tier - 2,tier - 3,R1013,no,no
1,Id2334,1992,Nov,30,0,570.62,tier - 2,tier - 1,R1013,no,no
2,Id2333,1993,NaN,30,0,600.00,tier - 2,tier - 1,R1013,no,no
3,Id2332,1992,Sep,13,0,604.54,tier - 3,tier - 3,R1013,no,no
4,Id2331,1998,Jul,27,0,637.26,tier - 3,tier - 3,R1013,no,no

**Task 2: Identifying Null Values in Hospitalization Details**

In this task, we identify and count the null values in the 'hosp_details' dataset. This step is crucial for our new project, "Medical Dataset Analysis: Python, SQL, and Insights," as it helps us understand the extent of missing data within the dataset. Recognizing and handling null values is essential for ensuring the accuracy and quality of our data analysis and insights.

In [4]:
null_values = hosp_details.isnull().sum()
null_values

c_id                     0
yr                       0
mth                      1
date?                    0
children?                0
charges?                 0
host_tier                0
Ct_tier                  0
st_id                    0
Has_Children             0
Is_Frequent_Treatment    0
dtype: int64

In [5]:
#remove the null values
remove_null_value = hosp_details.dropna(inplace = True)
remove_null_value

**Task 3: Identifying Data Types in Hospitalization Details**

In this task, we determine the data types of the columns in the 'hosp_details' dataset. This step is vital for our data analysis, as it provides insights into how the data is stored and helps us select appropriate methods for further analysis. Understanding the data types is crucial for working with the dataset effectively.

In [6]:
data_types = hosp_details.dtypes
data_types

c_id                      object
yr                         int64
mth                       object
date?                      int64
children?                  int64
charges?                 float64
host_tier                 object
Ct_tier                   object
st_id                     object
Has_Children              object
Is_Frequent_Treatment     object
dtype: object

**Task 4: Identifying Duplicate Data in Hospitalization Details**

In this task, we aim to identify and quantify the presence of duplicate data within the 'hosp_details' dataset. The count of duplicates (referred to as 'duplicates' in the code) is an important metric. It helps us understand the extent of redundancy in the dataset, which is crucial for data quality and accuracy in our analysis. By recognizing and handling duplicate records, we ensure that our insights and conclusions are based on unique, meaningful data, preventing any potential distortions caused by repeated entries.

In [7]:
duplicate_data = hosp_details.duplicated().sum()
duplicate_data

89

**Task 5: **Data Preprocessing and Cleaning for Hospitalization Details****

In this task, we perform data preprocessing and cleaning on the 'hosp_details' dataset. We start by removing duplicate records to ensure data quality and accuracy. Next, we remove specific columns, 'Has_Children' and 'Is_Frequent_Treatment,' as they are not relevant to our analysis. We also rename columns to improve clarity and understanding of the data. Finally, we save the cleaned dataset as 'hospitalisation_details_cleaned.csv.' This data preprocessing and cleaning is crucial for our analysis, as it ensures that we work with accurate and meaningful data in our new project.

In [8]:
# remove duplicates and unwanted columns 
hosp_details.drop_duplicates(inplace = True)
hosp_details.drop(['Has_Children','Is_Frequent_Treatment'], axis = 1, inplace = True)

In [9]:
#rename the columns
hosp_details.rename(columns = {'c_id' : 'customer_id',
                               'yr' : 'year',
                               'mth' : 'month',
                               'date?' : 'date',
                               'children?' : 'children',
                               'charges?' : 'charges',
                               'host_tier' : 'hospital_tier',
                               'Ct_tier': 'city_tier',
                               'st_id': 'state_id'}, inplace=True)

In [10]:
hosp_details.to_csv('hospitalisation_details_cleaned.csv', index=False, index_label='customer_id')

In [11]:
#Check the clean data
hosp = pd.read_csv('hospitalisation_details_cleaned.csv')
hosp.head()

,customer_id,year,month,date,children,charges,hospital_tier,city_tier,state_id
0,Id2335,1992,Jul,9,0,563.84,tier - 2,tier - 3,R1013
1,Id2334,1992,Nov,30,0,570.62,tier - 2,tier - 1,R1013
2,Id2332,1992,Sep,13,0,604.54,tier - 3,tier - 3,R1013
3,Id2331,1998,Jul,27,0,637.26,tier - 3,tier - 3,R1013
4,Id2330,2001,Nov,20,0,646.14,tier - 3,tier - 3,R1012

**Task 6: Loading Medical Examination Data**

In this task, we load the medical examination data from the 'medical_examinations.csv' file into a Pandas DataFrame named 'med_exam.' This step is essential for our new project, "Medical Dataset Analysis: Python, SQL, and Insights," as it forms the foundation for the data analysis and insights that we aim to derive from the medical dataset.

In [12]:
#load the data medical_examinantion
med_exam = pd.read_csv('medical_examinations.csv')
med_exam

,cid,b_m_i,HBA1C,h_Issues,any_transplant,cancer_hist,noofmajorsurgeries,smoker??,recovery_period
0,Id1,47.410,7.47,No,No,No,No major surgery,yes,NaN
1,Id2,30.360,5.77,No,No,No,No major surgery,yes,NaN
2,Id3,34.485,11.87,yes,No,No,2,yes,Moderate
3,Id4,38.095,6.05,No,No,No,No major surgery,yes,NaN
4,Id5,35.530,5.45,No,No,No,No major surgery,yes,NaN
...,...,...,...,...,...,...,...,...,...
2369,Id128,32.775,4.72,No,No,No,No major surgery,yes,NaN
2370,Id129,34.200,5.91,yes,No,No,No major surgery,yes,NaN
2371,Id130,30.200,9.58,No,No,No,No major surgery,yes,NaN
2372,Id131,48.320,5.77,No,No,No,No major surgery,yes,NaN
2373,Id132,44.860,4.38,yes,No,No,No major surgery,yes,NaN

**Task 7: Identifying Null Values in Medical Examination Data**

In this task, we identify and count the null values in the 'med_exam' dataset. This step is crucial for our new project, as it helps us understand the extent of missing data within the dataset. Recognizing and handling null values is essential for ensuring the accuracy and quality of our data analysis and insights.

In [13]:
null_values = med_exam.isnull().sum()
null_values

cid                      0
b_m_i                    0
HBA1C                    0
h_Issues                 0
any_transplant           0
cancer_hist              0
noofmajorsurgeries       0
smoker??                 0
recovery_period       1096
dtype: int64

In [14]:
# Replace all occurrences of "nomajorsurgeries" with 0 in the 'nomajorsurgeries' column
med_exam['noofmajorsurgeries'].replace('No major surgery', 0, inplace= True)

**Task 8: Identifying Data Types in Medical Examination Data**

In this task, we determine the data types of the columns in the 'med_exam' dataset. This step is vital for our data analysis, as it provides insights into how the data is stored and helps us select appropriate methods for further analysis. Understanding the data types is crucial for working with the dataset effectively.

In [15]:
data_tpes = med_exam.dtypes
data_types

c_id                      object
yr                         int64
mth                       object
date?                      int64
children?                  int64
charges?                 float64
host_tier                 object
Ct_tier                   object
st_id                     object
Has_Children              object
Is_Frequent_Treatment     object
dtype: object

**Task 9: Identifying Duplicate Data in Medical Examination Data**

In this task, we aim to identify and quantify the presence of duplicate data within the 'med_exam' dataset. The count of duplicates (referred to as 'duplicates' in the code) is an important metric. It helps us understand the extent of redundancy in the dataset, which is crucial for data quality and accuracy in our analysis. By recognizing and handling duplicate records, we ensure that our insights and conclusions are based on unique, meaningful data, preventing any potential distortions caused by repeated entries.

In [16]:
duplicates_data = med_exam.duplicated().sum()
duplicates_data

39

**Task 10: Data Preprocessing and Cleaning for Medical Examination Data**

In this task, we perform data preprocessing and cleaning on the 'med_exam' dataset. We start by removing duplicate records to ensure data quality and accuracy. Next, we remove a specific column, 'recovery_period,' as it may not be relevant to our analysis. We also rename columns to improve clarity and understanding of the data. Finally, we save the cleaned dataset as 'medical_examinations_cleaned.csv.' This data preprocessing and cleaning is crucial for our analysis, as it ensures that we work with accurate and meaningful data in our new project.

In [17]:
# reomve and drop the duplicates and unwated columns
med_exam.drop_duplicates(inplace = True)
med_exam.drop(['recovery_period'], axis = 1, inplace = True)

In [18]:
med_exam.rename(columns = { 'cid' : 'customer_id',
                           'b_m_i' : 'BMI',
                           'h_Issues' : 'health_issues',
                           'cancer_hist' : 'cancer_history',
                           'noofmajorsurgeries' : 'numberofmajorsurgeries',
                           'smoker??' : 'smoker'}, inplace= True)
#--- Export the df as "medical_examinations_cleaned.csv" ---
med_exam.to_csv('medical_examinations_cleaned.csv', index = False, index_label = 'customer_id')
med_exam

,customer_id,BMI,HBA1C,health_issues,any_transplant,cancer_history,numberofmajorsurgeries,smoker
0,Id1,47.410,7.47,No,No,No,0,yes
1,Id2,30.360,5.77,No,No,No,0,yes
2,Id3,34.485,11.87,yes,No,No,2,yes
3,Id4,38.095,6.05,No,No,No,0,yes
4,Id5,35.530,5.45,No,No,No,0,yes
...,...,...,...,...,...,...,...,...
2330,Id2331,22.340,5.57,No,No,No,1,No
2331,Id2332,17.700,6.28,No,No,No,1,No
2332,Id2333,16.470,6.35,No,No,Yes,1,No
2333,Id2334,17.600,4.39,No,No,No,1,No
2334,Id2335,17.580,4.51,No,No,No,1,No

# **Module 2**
**Task 1: Data Download, Import, and Database Connection**

In [19]:
%load_ext sql
# Replace "xxxxxxx" with your actual password
connection_string = "postgresql://postgres:password@localhost:5432/Medical"

# Use the %sql magic command with the connection string
%sql $connection_string

In [20]:
# Example SQL query
%sql  SELECT * FROM hospitalisation_details limit 10;

 * postgresql://postgres:***@localhost:5432/Medical
10 rows affected.

[('Id2335', 1992, 'Jul', 9, 0, 563.84, 'tier - 2', 'tier - 3', 'R1013'),
 ('Id2334', 1992, 'Nov', 30, 0, 570.62, 'tier - 2', 'tier - 1', 'R1013'),
 ('Id2332', 1992, 'Sep', 13, 0, 604.54, 'tier - 3', 'tier - 3', 'R1013'),
 ('Id2331', 1998, 'Jul', 27, 0, 637.26, 'tier - 3', 'tier - 3', 'R1013'),
 ('Id2330', 2001, 'Nov', 20, 0, 646.14, 'tier - 3', 'tier - 3', 'R1012'),
 ('Id2329', 1993, 'Jun', 1, 0, 650.0, 'tier - 3', 'tier - 3', 'R1013'),
 ('Id2328', 1995, 'Jul', 4, 0, 650.0, 'tier - 3', 'tier - 3', 'R1013'),
 ('Id2327', 2002, 'Nov', 29, 0, 668.0, 'tier - 3', 'tier - 2', 'R1012'),
 ('Id2326', 1997, 'Nov', 9, 0, 670.0, 'tier - 3', 'tier - 3', 'R1013'),
 ('Id2325', 2001, 'Sep', 12, 0, 687.54, 'tier - 3', 'tier - 2', 'R1013')]

**Task 2: Average Hospital Charges Analysis**

In this project, we aim to analyze a medical dataset to determine the average hospital charges. This analysis can provide essential insights into healthcare cost trends, helping hospitals and patients understand the financial aspects of medical care. By calculating the average hospital charges, we gain valuable information for financial planning, cost optimization, and transparency in healthcare services.

In [21]:
%sql SELECT AVG(charges) as avg_charges FROM hospitalisation_details;

 * postgresql://postgres:***@localhost:5432/Medical
1 rows affected.

[(13564.601204099052,)]

**Task 3: High Charges Analysis**

This project focuses on identifying unique customer identifiers, corresponding years, and charges from a specific medical dataset, specifically for records where charges exceed 700. By retrieving this data, we can gain insights into cases of exceptionally high hospital charges, which can inform further investigation, cost control strategies, and patient financial support.

In [22]:
%%sql
select customer_id, year, charges  from hospitalisation_details
where charges>700
limit 10;

 * postgresql://postgres:***@localhost:5432/Medical
10 rows affected.

[('Id2323', 1999, 722.99),
 ('Id2322', 2002, 750.0),
 ('Id2321', 1993, 760.0),
 ('Id2320', 1996, 760.0),
 ('Id2319', 1993, 770.0),
 ('Id2318', 1996, 770.38),
 ('Id2317', 1995, 773.54),
 ('Id2316', 2004, 830.52),
 ('Id2315', 2000, 865.41),
 ('Id2314', 1993, 896.21)]

**Task 4: High BMI Patients Analysis**

In this project, we aim to retrieve the name, year, and charges for customers with a BMI (Body Mass Index) greater than 35 from a medical dataset. Analyzing the data of high BMI patients allows us to understand the healthcare costs associated with this specific group. This information can be valuable for identifying health trends, managing patient care, and optimizing medical expenses.

In [23]:
%%sql
SELECT n.name, h.year, h.charges
FROM hospitalisation_details AS h
JOIN medical_examinations AS m ON h.customer_id = m.customer_id
JOIN names AS n ON n.customer_id = m.customer_id
WHERE m.BMI > 35
limit 10;

 * postgresql://postgres:***@localhost:5432/Medical
10 rows affected.

[('Hawks, Ms.  Kelly', 1968, 63770.43),
 ('Osborne, Ms.  Kelsey', 1991, 58571.07),
 ('Kadala, Ms.  Kristyn', 1989, 55135.4),
 ('Macpherson, Mr.  Scott', 1994, 51194.56),
 ('Hallman, Mr.  Stephen', 1958, 49577.66),
 ('Moran, Mr.  Patrick R.', 1963, 48970.25),
 ('Benner, Ms.  Brooke N.', 1978, 48885.14),
 ('Fierro Vargas, Ms.  Paola Andrea', 1959, 48824.45),
 ('Franz, Mr.  David', 1965, 48675.52),
 ('Foster, Mr.  Wade', 1962, 48673.56)]

**Task 5: Customers with Major Surgeries**

This project focuses on listing customer IDs and names of individuals from the names table who have undergone major surgeries, as recorded in the medical_examinations table. By identifying such patients, we can gain insights into the population with a history of major surgical procedures, which can inform healthcare planning, risk assessment, and medical follow-up.

In [24]:
%%sql
SELECT n.customer_id, n.name
FROM names AS n
JOIN medical_examinations AS m ON n.customer_id = m.customer_id
WHERE m.numberofmajorsurgeries >= 1
limit 10;

 * postgresql://postgres:***@localhost:5432/Medical
10 rows affected.

[('Id3', 'Lu, Mr.  Phil'),
 ('Id8', 'Hallman, Mr.  Stephen'),
 ('Id9', 'Moran, Mr.  Patrick R.'),
 ('Id11', 'Fierro Vargas, Ms.  Paola Andrea'),
 ('Id15', 'Rios, Ms.  Leilani M.'),
 ('Id17', 'Cronin, Ms.  Jennifer A.'),
 ('Id18', 'Noordstar, Ms.  Christina M.'),
 ('Id19', 'Boudalia, Mr.  Said Sr.'),
 ('Id21', 'Fennon, Mr.  Myles'),
 ('Id22', 'Hribar, Ms.  Madelyn C')]

**Task 6: Average Charges by Hospital Tier in 2000**

In this project, we aim to calculate the average hospital charges per hospital tier for the year 2000 from the hospitalization_details table. This analysis allows us to understand the variation in charges based on the hospital tier, providing insights into cost disparities and healthcare quality across different tiers. It can assist in making informed decisions about healthcare facilities and costs.

In [25]:
%%sql
select hospital_tier, avg(charges) from hospitalisation_details
where year = 2000
group by hospital_tier;

 * postgresql://postgres:***@localhost:5432/Medical
3 rows affected.

[('tier - 1', 35367.4375),
 ('tier - 3', 4673.116666666667),
 ('tier - 2', 8915.937027027028)]

**Task 7: Smoking Patients with Transplants Analysis**

This project aims to retrieve customer IDs, BMI, and charges for patients who are smokers and have undergone a transplant, as per the medical_examinations and hospitalization_details tables. Analyzing this data allows us to study the healthcare costs and health conditions of patients with a history of smoking and transplants. This information can be valuable for targeted healthcare interventions and cost estimation.

In [26]:
%%sql
select m.customer_id, m.BMI, h.charges from medical_examinations as m
JOIN hospitalisation_details as h ON h.customer_id = m.customer_id
where smoker = 'yes' AND any_transplant = 'yes';

 * postgresql://postgres:***@localhost:5432/Medical
25 rows affected.

[('Id824', 17.29, 12829.46),
 ('Id742', 21.565, 13747.87),
 ('Id707', 21.66, 14283.46),
 ('Id575', 27.36, 17178.68),
 ('Id543', 27.28, 18223.45),
 ('Id428', 25.71, 24294.02),
 ('Id399', 27.79, 26026.97),
 ('Id394', 32.06, 26316.59),
 ('Id391', 32.54, 26479.4),
 ('Id386', 30.86, 26936.98),
 ('Id315', 43.5, 30328.27),
 ('Id304', 46.06, 31196.61),
 ('Id303', 43.53, 31234.56),
 ('Id257', 31.73, 33732.69),
 ('Id254', 51.18, 33829.39),
 ('Id252', 30.4, 33907.55),
 ('Id235', 33.535, 34617.84),
 ('Id211', 35.6, 35585.58),
 ('Id210', 31.02, 35595.59),
 ('Id199', 36.85, 36149.48),
 ('Id194', 38.17, 36307.8),
 ('Id170', 37.62, 37165.16),
 ('Id163', 37.07, 37484.45),
 ('Id137', 42.24, 38792.69),
 ('Id41', 52.58, 44501.4)]

**Task 8: Patients with Major Surgeries or Cancer History**

In this project, we retrieve the names of customers who have had at least two major surgeries or have a history of cancer, as recorded in the medical_examinations table. This analysis helps identify patients with complex medical histories, enabling healthcare providers to tailor care plans and assess potential healthcare costs for these individuals.n.

In [27]:
%%sql
select n.name from  names as n
JOIN medical_examinations as m ON m.customer_id = n.customer_id
where cancer_history = 'Yes' OR numberofmajorsurgeries >= 2
limit 10;

 * postgresql://postgres:***@localhost:5432/Medical
10 rows affected.

[('Lu, Mr.  Phil',),
 ('Hallman, Mr.  Stephen',),
 ('Moran, Mr.  Patrick R.',),
 ('Fierro Vargas, Ms.  Paola Andrea',),
 ('Rios, Ms.  Leilani M.',),
 ('Cronin, Ms.  Jennifer A.',),
 ('Noordstar, Ms.  Christina M.',),
 ('Fennon, Mr.  Myles',),
 ('Hribar, Ms.  Madelyn C',),
 ('Tassello, Ms.  Nicole',)]

**Task 9: Customer with Most Major Surgeries**

In this project, we identify and display the customer with the highest number of major surgeries. By joining the names and medical_examinations tables and sorting the records by the number of major surgeries in descending order, we can pinpoint the customer with the most significant surgical history. This insight is valuable for personalized healthcare management and resource allocation.n.

In [28]:
%%sql
select n.customer_id, n.name from  names as n
JOIN medical_examinations as m ON m.customer_id = n.customer_id
order by numberofmajorsurgeries desc
limit 1;

 * postgresql://postgres:***@localhost:5432/Medical
1 rows affected.

[('Id8', 'Hallman, Mr.  Stephen')]

**Task 10: Customers with Major Surgeries and City Tiers**

In this project, we compile a list of customers who have undergone major surgeries and their respective cities' tier levels (city_tier) from the hospitalization_details table. This analysis provides insights into the distribution of major surgeries across different city tiers, aiding in healthcare planning, resource allocation, and assessing the impact of city tiers on surgical cases.n.

In [29]:
%%sql
SELECT n.customer_id, n.name, h.city_tier
FROM hospitalisation_details AS h
JOIN medical_examinations AS m ON h.customer_id = m.customer_id
JOIN names AS n ON n.customer_id = m.customer_id
where numberofmajorsurgeries > 0
limit 10;

 * postgresql://postgres:***@localhost:5432/Medical
10 rows affected.

[('Id3', 'Lu, Mr.  Phil', 'tier - 1'),
 ('Id8', 'Hallman, Mr.  Stephen', 'tier - 2'),
 ('Id9', 'Moran, Mr.  Patrick R.', 'tier - 2'),
 ('Id11', 'Fierro Vargas, Ms.  Paola Andrea', 'tier - 1'),
 ('Id15', 'Rios, Ms.  Leilani M.', 'tier - 3'),
 ('Id17', 'Cronin, Ms.  Jennifer A.', 'tier - 3'),
 ('Id18', 'Noordstar, Ms.  Christina M.', 'tier - 3'),
 ('Id19', 'Boudalia, Mr.  Said Sr.', 'tier - 3'),
 ('Id21', 'Fennon, Mr.  Myles', 'tier - 3'),
 ('Id22', 'Hribar, Ms.  Madelyn C', 'tier - 1')]

**Task 11: Average BMI by City Tier in 1995**

This project aims to calculate the average BMI for each city tier level in the year 1995 from the hospitalization_details table. Analyzing the average BMI across different city tiers allows us to understand the variations in health parameters among urban areas. It provides insights that can be used for health planning, resource allocation, and identifying potential health trends.n.

In [30]:
%%sql
select h.city_tier, AVG(m.BMI) as avg_bmi 
FROM hospitalisation_details AS h
JOIN medical_examinations AS m ON h.customer_id = m.customer_id
where year = 1995
group by h.city_tier

 * postgresql://postgres:***@localhost:5432/Medical
3 rows affected.

[('tier - 1', 29.818666666666672),
 ('tier - 3', 30.685714285714283),
 ('tier - 2', 29.43235294117647)]

**Task 12: High BMI Customers with Health Issues**

In this project, we extract customer IDs, names, and charges of customers who have health issues and a BMI greater than 30. By combining data from the names, medical_examinations, and hospitalization_details tables, we can identify individuals with specific health concerns and high BMI levels. This information is valuable for targeted healthcare interventions and assessing associated healthcare costs.n.

In [31]:
%%sql
SELECT n.customer_id, n.name, h.charges
FROM hospitalisation_details AS h
JOIN medical_examinations AS m ON h.customer_id = m.customer_id
JOIN names AS n ON n.customer_id = m.customer_id
where health_issues = 'yes' and m.BMI > 30
limit 10;

 * postgresql://postgres:***@localhost:5432/Medical
10 rows affected.

[('Id3', 'Lu, Mr.  Phil', 60021.4),
 ('Id9', 'Moran, Mr.  Patrick R.', 48970.25),
 ('Id11', 'Fierro Vargas, Ms.  Paola Andrea', 48824.45),
 ('Id15', 'Rios, Ms.  Leilani M.', 48517.56),
 ('Id18', 'Noordstar, Ms.  Christina M.', 47896.79),
 ('Id19', 'Boudalia, Mr.  Said Sr.', 47496.49),
 ('Id21', 'Fennon, Mr.  Myles', 47403.88),
 ('Id22', 'Hribar, Ms.  Madelyn C', 47305.31),
 ('Id24', 'Mauricette, Mr.  Eric A.', 47269.85),
 ('Id25', 'Garcia, Mr.  Emiliano I.', 47055.53)]

**Task 13: Customers with Highest Charges and City Tier by Year**

In this project, we identify the customer with the highest total charges for each year and display their corresponding city_tier. By joining the hospitalization_details and names tables and grouping the data by year, customer name, and city_tier, we can determine which customer incurred the highest charges in each year. This analysis is crucial for understanding cost patterns over time and tailoring healthcare strategies accordingly.n.

In [32]:
%%sql
SELECT h.year, n.name, h.city_tier, max(h.charges) asmax_charges
FROM hospitalisation_details AS h
JOIN names AS n ON n.customer_id = h.customer_id
group by h.year, n.name, h.city_tier
Having max(h.charges) = (select max(charges) from hospitalisation_details where year = h.year)
limit 10;

 * postgresql://postgres:***@localhost:5432/Medical
10 rows affected.

[(1997, 'Johnson, Mr.  Steven M.', 'tier - 3', 42112.24),
 (2000, 'Jenkins, Mr.  James R.', 'tier - 3', 44501.4),
 (1992, 'Cutler, Ms.  Hope', 'tier - 2', 40932.43),
 (1987, 'Potter, Ms.  Amanda', 'tier - 3', 39983.43),
 (1964, 'Boudalia, Mr.  Said Sr.', 'tier - 3', 47496.49),
 (1999, 'Derian, Ms.  Elyse M.', 'tier - 1', 40904.2),
 (1986, 'Sobrilsky, Mr.  Anthony J.', 'tier - 1', 43753.34),
 (1991, 'Osborne, Ms.  Kelsey', 'tier - 3', 58571.07),
 (1982, 'Ganley, Ms.  Emily J', 'tier - 1', 40003.33),
 (1973, 'Hyland, Ms.  Megan', 'tier - 1', 42188.15)]

**Task 14: Top 3 Customers with Highest Average Yearly Charges**

This project focuses on identifying the top 3 customers with the highest average yearly charges over the years they have been hospitalized. By calculating and analyzing the average yearly charges from the hospitalization_details data and joining it with customer names, we can pinpoint those individuals with the highest healthcare expenditure. Understanding these patterns is essential for resource allocation and tailored healthcare planning.n.

In [33]:
%%sql
with Yearlycharges as ( 
    select customer_id, avg(charges) as avg_yearly_Charges 
    from hospitalisation_details group by customer_id, year)
Select n.name, y.avg_yearly_Charges from names n
JOIN Yearlycharges as y ON y.customer_id = n.customer_id
order by y.avg_yearly_Charges desc
limit 3;

 * postgresql://postgres:***@localhost:5432/Medical
3 rows affected.

[('Hawks, Ms.  Kelly', 63770.43),
 ('Lehner, Mr.  Matthew D', 62592.87),
 ('Lu, Mr.  Phil', 60021.4)]

**Task 15: Ranking Customers by Total Charges**

This analysis aims to rank customers based on their total charges over the years in descending order. By summing up the charges from the hospitalization_details data for each customer and assigning a rank, we can identify those with the highest healthcare expenses. This information is valuable for healthcare providers and policymakers in tailoring services and managing resources effectively.n.

In [34]:
%%sql
SELECT n.name, sum(h.charges) as total_charges, RANK() OVER (ORDER BY SUM(h.charges) desc) AS charges_rank
FROM hospitalisation_details AS h
JOIN names AS n ON n.customer_id = h.customer_id
group by n.name
order by charges_rank asc
limit 10;

 * postgresql://postgres:***@localhost:5432/Medical
10 rows affected.

[('Hawks, Ms.  Kelly', 63770.43, 1),
 ('Lehner, Mr.  Matthew D', 62592.87, 2),
 ('Lu, Mr.  Phil', 60021.4, 3),
 ('Osborne, Ms.  Kelsey', 58571.07, 4),
 ('Kadala, Ms.  Kristyn', 55135.4, 5),
 ('Baker, Mr.  Russell B.', 52590.83, 6),
 ('Macpherson, Mr.  Scott', 51194.56, 7),
 ('Hallman, Mr.  Stephen', 49577.66, 8),
 ('Moran, Mr.  Patrick R.', 48970.25, 9),
 ('Benner, Ms.  Brooke N.', 48885.14, 10)]

**Task 16: Identifying Peak Year for Hospitalizations**

This task is essential for identifying the year with the highest number of hospitalizations. By calculating the count of hospitalizations for each year from the hospitalization_details dataset, we can pinpoint the peak year for healthcare demand. This insight can help healthcare institutions allocate resources and plan for peak demand years more effectively.

In [35]:
%%sql
WITH YearlyHospitalizations AS (
    SELECT
        year,
        COUNT(*) AS num_hospitalizations
    FROM
        hospitalisation_details
    GROUP BY
        year
)
SELECT
    year,
    num_hospitalizations
FROM
    YearlyHospitalizations
WHERE
    num_hospitalizations = (SELECT MAX(num_hospitalizations) FROM YearlyHospitalizations);

 * postgresql://postgres:***@localhost:5432/Medical
1 rows affected.

[(2004, 100)]